In [ ]:
%load_ext sql

In [ ]:
%sql postgresql://postgres:123456@localhost/postgres

# Create Tables

It may appear some error message when running the codes but it is actually fine.
Please check the table after tables are created.

In [ ]:
#%sql DROP SCHEMA window_func CASCADE;

In [ ]:
%sql CREATE SCHEMA window_func;

In [ ]:
%sql CREATE TABLE window_func.product_groups ( \
     group_id serial PRIMARY KEY, \
     group_name VARCHAR (255) NOT NULL \
     );

In [ ]:
%sql INSERT INTO window_func.product_groups (group_name) VALUES ('Smartphone'),('Laptop'),('Tablet');

In [ ]:
%sql SELECT * FROM window_func.product_groups;

In [ ]:
%sql CREATE TABLE window_func.products ( \
     product_id serial PRIMARY KEY, \
     product_name VARCHAR (255) NOT NULL, \
     price DECIMAL (11, 2), \
     group_id INT NOT NULL, \
     FOREIGN KEY (group_id) REFERENCES window_func.product_groups (group_id) \
     );

In [ ]:
%sql INSERT INTO window_func.products (product_name, group_id,price) \
     VALUES \
     ('Microsoft Lumia', 1, 200), \
     ('HTC One', 1, 400), \
     ('Nexus', 1, 500), \
     ('iPhone', 1, 900), \
     ('HP Elite', 2, 1200), \
     ('Lenovo Thinkpad', 2, 700), \
     ('Sony VAIO', 2, 700), \
     ('Dell Vostro', 2, 800), \
     ('iPad', 3, 700), \
     ('Kindle Fire', 3, 150), \
     ('Samsung Galaxy Tab', 3, 200);

In [ ]:
%sql SELECT * FROM window_func.products;

In [ ]:
%sql CREATE TABLE window_func.sales_stats( \
     name VARCHAR(100) NOT NULL, \
     year SMALLINT NOT NULL CHECK (year > 0), \
     amount DECIMAL(10,2) CHECK (amount >= 0), \
     PRIMARY KEY (name,year) \
     );

In [ ]:
%sql INSERT INTO window_func.sales_stats(name, year, amount) \
     VALUES \
     ('John Doe',2018,120000), \
     ('Jane Doe',2018,110000), \
     ('Jack Daniel',2018,150000), \
     ('Yin Yang',2018,30000), \
     ('Stephane Heady',2018,200000), \
     ('John Doe',2019,150000), \
     ('Jane Doe',2019,130000), \
     ('Jack Daniel',2019,180000), \
     ('Yin Yang',2019,25000), \
     ('Stephane Heady',2019,270000);

In [14]:
%sql SELECT * FROM window_func.sales_stats;

 * postgresql://postgres:***@localhost/postgres
10 rows affected.

[('John Doe', 2018, Decimal('120000.00')),
 ('Jane Doe', 2018, Decimal('110000.00')),
 ('Jack Daniel', 2018, Decimal('150000.00')),
 ('Yin Yang', 2018, Decimal('30000.00')),
 ('Stephane Heady', 2018, Decimal('200000.00')),
 ('John Doe', 2019, Decimal('150000.00')),
 ('Jane Doe', 2019, Decimal('130000.00')),
 ('Jack Daniel', 2019, Decimal('180000.00')),
 ('Yin Yang', 2019, Decimal('25000.00')),
 ('Stephane Heady', 2019, Decimal('270000.00'))]

# Window Function

**Example 1** \
Categorize the group (labtop, smartphone, tablet) and show the average price.

In [19]:
# Let's check the table without window function first.

%sql SELECT product_name, price, group_name \
     FROM window_func.products \
     INNER JOIN window_func.product_groups USING (group_id);

 * postgresql://postgres:***@localhost/postgres
11 rows affected.

[('Microsoft Lumia', Decimal('200.00'), 'Smartphone'),
 ('HTC One', Decimal('400.00'), 'Smartphone'),
 ('Nexus', Decimal('500.00'), 'Smartphone'),
 ('iPhone', Decimal('900.00'), 'Smartphone'),
 ('HP Elite', Decimal('1200.00'), 'Laptop'),
 ('Lenovo Thinkpad', Decimal('700.00'), 'Laptop'),
 ('Sony VAIO', Decimal('700.00'), 'Laptop'),
 ('Dell Vostro', Decimal('800.00'), 'Laptop'),
 ('iPad', Decimal('700.00'), 'Tablet'),
 ('Kindle Fire', Decimal('150.00'), 'Tablet'),
 ('Samsung Galaxy Tab', Decimal('200.00'), 'Tablet')]

In [17]:
%sql SELECT product_name, price, group_name, \
     AVG(price::float) OVER (PARTITION BY group_name) \
     FROM window_func.products \
     INNER JOIN window_func.product_groups USING (group_id);

 * postgresql://postgres:***@localhost/postgres
11 rows affected.

[('HP Elite', Decimal('1200.00'), 'Laptop', 850.0),
 ('Lenovo Thinkpad', Decimal('700.00'), 'Laptop', 850.0),
 ('Sony VAIO', Decimal('700.00'), 'Laptop', 850.0),
 ('Dell Vostro', Decimal('800.00'), 'Laptop', 850.0),
 ('Microsoft Lumia', Decimal('200.00'), 'Smartphone', 500.0),
 ('HTC One', Decimal('400.00'), 'Smartphone', 500.0),
 ('Nexus', Decimal('500.00'), 'Smartphone', 500.0),
 ('iPhone', Decimal('900.00'), 'Smartphone', 500.0),
 ('iPad', Decimal('700.00'), 'Tablet', 350.0),
 ('Kindle Fire', Decimal('150.00'), 'Tablet', 350.0),
 ('Samsung Galaxy Tab', Decimal('200.00'), 'Tablet', 350.0)]

Explanation:
1. `OVER (PARTITION BY)` is the window function to categorize.
2. The `avg` is the average price of each group.

**Example 2** \
Categorize the group (labtop, smartphone, tablet) and add the row number.

In [20]:
%sql SELECT product_name, group_name, price, \
     ROW_NUMBER () OVER (PARTITION BY group_name ORDER BY price) \
     FROM window_func.products \
     INNER JOIN window_func.product_groups USING (group_id);

 * postgresql://postgres:***@localhost/postgres
11 rows affected.

[('Sony VAIO', 'Laptop', Decimal('700.00'), 1),
 ('Lenovo Thinkpad', 'Laptop', Decimal('700.00'), 2),
 ('Dell Vostro', 'Laptop', Decimal('800.00'), 3),
 ('HP Elite', 'Laptop', Decimal('1200.00'), 4),
 ('Microsoft Lumia', 'Smartphone', Decimal('200.00'), 1),
 ('HTC One', 'Smartphone', Decimal('400.00'), 2),
 ('Nexus', 'Smartphone', Decimal('500.00'), 3),
 ('iPhone', 'Smartphone', Decimal('900.00'), 4),
 ('Kindle Fire', 'Tablet', Decimal('150.00'), 1),
 ('Samsung Galaxy Tab', 'Tablet', Decimal('200.00'), 2),
 ('iPad', 'Tablet', Decimal('700.00'), 3)]

**Example 3** \
Categorize the group (labtop, smartphone, tablet) and add the rank.

In [32]:
%sql SELECT product_name, group_name, price, \
     RANK () OVER (PARTITION BY group_name ORDER BY price), \
     DENSE_RANK () OVER (PARTITION BY group_name ORDER BY price),\
     PERCENT_RANK () OVER (PARTITION BY group_name ORDER BY price), \
     CUME_DIST() OVER (PARTITION BY group_name ORDER BY price) \
     FROM window_func.products \
     INNER JOIN window_func.product_groups USING (group_id);

 * postgresql://postgres:***@localhost/postgres
11 rows affected.

[('Sony VAIO', 'Laptop', Decimal('700.00'), 1, 1, 0.0, 0.5),
 ('Lenovo Thinkpad', 'Laptop', Decimal('700.00'), 1, 1, 0.0, 0.5),
 ('Dell Vostro', 'Laptop', Decimal('800.00'), 3, 2, 0.6666666666666666, 0.75),
 ('HP Elite', 'Laptop', Decimal('1200.00'), 4, 3, 1.0, 1.0),
 ('Microsoft Lumia', 'Smartphone', Decimal('200.00'), 1, 1, 0.0, 0.25),
 ('HTC One', 'Smartphone', Decimal('400.00'), 2, 2, 0.3333333333333333, 0.5),
 ('Nexus', 'Smartphone', Decimal('500.00'), 3, 3, 0.6666666666666666, 0.75),
 ('iPhone', 'Smartphone', Decimal('900.00'), 4, 4, 1.0, 1.0),
 ('Kindle Fire', 'Tablet', Decimal('150.00'), 1, 1, 0.0, 0.3333333333333333),
 ('Samsung Galaxy Tab', 'Tablet', Decimal('200.00'), 2, 2, 0.5, 0.6666666666666666),
 ('iPad', 'Tablet', Decimal('700.00'), 3, 3, 1.0, 1.0)]

Explanation:
1. `RANK` the next rank jumps the number if there are multiple same values for current rank.
2. `DENSE_RANK` won't jumps the number.
3. `PECENT_RANK` the percentage of the rank
4. `CUME_DIST` uniform the distance of percentage and then accumulate it.

**Example 4** \
Categorize the group (labtop, smartphone, tablet) and check the previous and next price, the difference of current and next price.

In [37]:
%sql SELECT product_name, group_name, price, \
     LAG (price, 1) OVER (PARTITION BY group_name ORDER BY price) AS previous_price, \
     LEAD (price, 1) OVER (PARTITION BY group_name ORDER BY price) AS next_price, \
     price - LEAD (price, 1) OVER (PARTITION BY group_name ORDER BY price) AS cur_next_diff \
     FROM window_func.products \
     INNER JOIN window_func.product_groups USING (group_id);

 * postgresql://postgres:***@localhost/postgres
11 rows affected.

[('Sony VAIO', 'Laptop', Decimal('700.00'), None, Decimal('700.00'), Decimal('0.00')),
 ('Lenovo Thinkpad', 'Laptop', Decimal('700.00'), Decimal('700.00'), Decimal('800.00'), Decimal('-100.00')),
 ('Dell Vostro', 'Laptop', Decimal('800.00'), Decimal('700.00'), Decimal('1200.00'), Decimal('-400.00')),
 ('HP Elite', 'Laptop', Decimal('1200.00'), Decimal('800.00'), None, None),
 ('Microsoft Lumia', 'Smartphone', Decimal('200.00'), None, Decimal('400.00'), Decimal('-200.00')),
 ('HTC One', 'Smartphone', Decimal('400.00'), Decimal('200.00'), Decimal('500.00'), Decimal('-100.00')),
 ('Nexus', 'Smartphone', Decimal('500.00'), Decimal('400.00'), Decimal('900.00'), Decimal('-400.00')),
 ('iPhone', 'Smartphone', Decimal('900.00'), Decimal('500.00'), None, None),
 ('Kindle Fire', 'Tablet', Decimal('150.00'), None, Decimal('200.00'), Decimal('-50.00')),
 ('Samsung Galaxy Tab', 'Tablet', Decimal('200.00'), Decimal('150.00'), Decimal('700.00'), Decimal('-500.00')),
 ('iPad', 'Tablet', Decimal('700.00'), Decimal('200.00'), None, None)]

Explanation:
1.  `LEAD(price,1)` "1" means jumping to next row. "2" means jumping two rows.

**Example 5** \
Divide the price into 3 different categories.

In [38]:
%sql SELECT product_name, price, group_name, \
     NTILE (3) OVER (order by price) \
     FROM window_func.products INNER JOIN window_func.product_groups USING (group_id);

 * postgresql://postgres:***@localhost/postgres
11 rows affected.

[('Kindle Fire', Decimal('150.00'), 'Tablet', 1),
 ('Microsoft Lumia', Decimal('200.00'), 'Smartphone', 1),
 ('Samsung Galaxy Tab', Decimal('200.00'), 'Tablet', 1),
 ('HTC One', Decimal('400.00'), 'Smartphone', 1),
 ('Nexus', Decimal('500.00'), 'Smartphone', 2),
 ('iPad', Decimal('700.00'), 'Tablet', 2),
 ('Lenovo Thinkpad', Decimal('700.00'), 'Laptop', 2),
 ('Sony VAIO', Decimal('700.00'), 'Laptop', 2),
 ('Dell Vostro', Decimal('800.00'), 'Laptop', 3),
 ('iPhone', Decimal('900.00'), 'Smartphone', 3),
 ('HP Elite', Decimal('1200.00'), 'Laptop', 3)]

**Example 6** \
Return all products together with the 3rd most expensive product.

In [51]:
%sql SELECT product_id, product_name, price, \
     FIRST_VALUE(product_name) \
     OVER (ORDER BY price DESC RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS first_value, \
     NTH_VALUE(product_name, 3) \
     OVER (ORDER BY price DESC RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING), \
     LAST_VALUE(product_name) \
     OVER (ORDER BY price DESC RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS last_value \
     FROM window_func.products;

 * postgresql://postgres:***@localhost/postgres
11 rows affected.

[(5, 'HP Elite', Decimal('1200.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (4, 'iPhone', Decimal('900.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (8, 'Dell Vostro', Decimal('800.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (6, 'Lenovo Thinkpad', Decimal('700.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (7, 'Sony VAIO', Decimal('700.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (9, 'iPad', Decimal('700.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (3, 'Nexus', Decimal('500.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (2, 'HTC One', Decimal('400.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (11, 'Samsung Galaxy Tab', Decimal('200.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (1, 'Microsoft Lumia', Decimal('200.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire'),
 (10, 'Kindle Fire', Decimal('150.00'), 'HP Elite', 'Dell Vostro', 'Kindle Fire')]